YounesRabeh/upm209-esp-extension/sdkconfig.defaults
# Shared ESP-IDF defaults for this project.
# Safe to commit: sensitive fields are intentionally blank.
#
# After cloning, set local values with:
#   idf.py menuconfig

CONFIG_IDF_TARGET="esp32s3"

#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=y
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# CONFIG_ESPTOOLPY_FLASHFREQ_120M is not set
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
CONFIG_ESPTOOLPY_BEFORE="default_reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
CONFIG_ESPTOOLPY_AFTER="hard_reset"
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

#
# Modbus-module Configuration
#
CONFIG_MODBUS_MANAGER_ENABLE=y

#
# Internet Configuration
#
CONFIG_INTERNET_TARGET_URL=""
# CONFIG_INTERNET_NETWORK_AUTO is not set
CONFIG_INTERNET_NETWORK_WIFI_ONLY=y
# CONFIG_INTERNET_NETWORK_LTE_ONLY is not set
CONFIG_WIFI_CONNECT_TIMEOUT_MS=5000
CONFIG_WIFI_CONNECT_RETRIES=3
CONFIG_WIFI_CONNECT_RETRY_DELAY_MS=500
CONFIG_WIFI_SSID=""
CONFIG_WIFI_PASSWORD=""
# CONFIG_WIFI_AUTH_OPEN is not set
CONFIG_WIFI_AUTH_WPA2_PSK=y
# CONFIG_WIFI_AUTH_WPA2_ENTERPRISE is not set

#
# Services Configuration
#
CONFIG_INTERNET_SERVICE_ENABLE=y
CONFIG_STORAGE_SERVICE_ENABLE=y
CONFIG_MODBUS_SERVICE_ENABLE=y
CONFIG_TIME_SERVICE_ENABLE=y
CONFIG_TIME_SERVICE_TZ="CET-1CEST,M3.5.0/2,M10.5.0/3"
CONFIG_TIME_SERVICE_SYNC_TIMEOUT_MS=15000
CONFIG_TIME_SERVICE_NTP_SERVER_1="time.google.com"

#
# Storage Configuration
#
CONFIG_MEMORY_LITTLEFS_MOUNT_POINT="/lfs"
CONFIG_MEMORY_LITTLEFS_PARTITION_LABEL="storage"
CONFIG_MEMORY_SAMPLE_QUEUE_BYTES=262144
CONFIG_MEMORY_MAX_REGISTERS=1084
CONFIG_MEMORY_OVERFLOW_OVERWRITE_OLDEST=y
# CONFIG_MEMORY_OVERFLOW_REJECT_NEWEST is not set
